#+title: Home Manager + restart-emacs
#+startup: content

Double-wrapping Emacs causes problems accessing packages, native compilation,
and restarting Emacs. This double-wrapping problem occurs when one uses the
=with*= functions more than once when producing an Emacs derivation.

Home Manager uses =emacsPackagesFor= and =emacsWithPackages= to build a final
package that shows up on one's machine, and when one uses those same mechanisms
to configure Emacs via Home Manager, double-wrapping will occur.

I am only using Home Manager's options to configure Emacs and running into
issues when restarting, where I see an invocation directory missing the
=with-packages= suffix.

** Everything Emacs
#+begin_src sh :results output list :exports both
fd --type directory --max-depth 1 'emacs-' /nix/store
#+end_src

#+results:
#+begin_example
- /nix/store/awnky7y0plbwqaq8hnmh8gcypzdwypzj-emacs-unstable-with-packages-29.2/
- /nix/store/25a8ihlnwdalc7sr35mlzbrr4bgfbkna-emacs-28.2/
- /nix/store/qjgpw70kwz140wrj7lk2pils9mnnfcac-emacs-vterm-20230417.424/
- /nix/store/zjv8h8hiixkxvz60xsmr6ds1q2rih2b6-emacs-packages-deps/
- /nix/store/xclpf9yyqzjfdwjbay17q85adiqmdwgj-emacs-vterm-20230417.424/
- /nix/store/vs9w294n6gm0mqdy3l59qjhw0k2b42ks-emacs-unstable-29.2/
- /nix/store/vlw849n0qpagqh0126d9mkyjz2l05mvw-emacs-packages-deps/
- /nix/store/xj5b3ng8dwbfcp6dv4lnnqi1c7k4qavx-emacs-unstable-with-packages-29.1.90/
- /nix/store/h9b1yj25ipw8wm8anm7fbi8rqc1w7vn9-emacs-unstable-29.1.90/
- /nix/store/q9aj7679vid9l5hxlr5dm1bssgskrgxh-emacs-unstable-with-packages-29.2/
- /nix/store/qhh1aa95id3jzqvxj169v61l4l7ycq72-emacs-unstable-29.2/
- /nix/store/4iraqrh9ylgkasclhf1bdn6g1ax8yai5-emacs-vterm-20230417.424/
- /nix/store/sfcz6812wwfl9l0060gf1l48176j1x75-emacs-vterm-20230417.424/
- /nix/store/18xc5gqydknqwl6fz89c0dnvcf24d3wa-emacs-unstable-with-packages-29.1.90/
- /nix/store/5f66cav1zv6xcdv8bblydm6az4whgfcx-emacs-packages-deps/
- /nix/store/6g5hxdxllqv3xy6ih530hgh04yf8wmlp-emacs-packages-deps/
- /nix/store/nax7zyq8hznfc8x66kamybrmidacvmk9-emacs-packages-deps/
- /nix/store/vi4cr17hfz9l5b8x0k6qa521k33pn80r-emacs-unstable-with-packages-29.2/
- /nix/store/wmpm0b7avcdspqw4dhhb05dign2mwp4s-emacs-unstable-29.2/
- /nix/store/qijacydwqch29a3vzkcxmbcnqsak7j7c-emacs-packages-deps/
- /nix/store/4d324ihqqh0yh54wszs7j0g2cjb5j8id-emacs-pgtk-29.1/
- /nix/store/hjqjdcdwymvwl65x58y87zq7mdldinpr-emacs-unstable-with-packages-29.2/
- /nix/store/plxbh95byi46aly8gsjk2yrnykx5whxj-emacs-vterm-20230417.424/
- /nix/store/n36m91f7mg2sb6ja93impyvlcxxk7zw7-emacs-packages-deps/
- /nix/store/zw9j2zm4gbbqynwasaaf2vc8jvzl0rp8-emacs-unstable-29.1.90/
- /nix/store/cxd0vqwxjkrr5d1s2s72kygkxkjh3pcn-emacs-vterm-20230417.424/
- /nix/store/50ngyajnf7zk6cj9b4r7648dhy1kdvvq-emacs-unstable-with-packages-with-packages-29.2/
- /nix/store/l80jsxbmgvqvjzbg656mxvzj8lp3vla2-emacs-pgtk-with-packages-29.1/
- /nix/store/r30zr2df02is7qk4g7lnzlsmfkzwsbpj-emacs-unstable-with-packages-29.2/
#+end_example

